Revit.Elements.InternalUtilities.ElementUtils.UpdateLevelName(System.String@)
This function checks if the name ends with "(num)". Here num is a integer.
If yes, it will replace "(num)" with "(num+1)". Here num+1 is the form of the
evaluated integer. Otherwise, it will append "(1)" at the end of the name.
For example:
This function will change the name from "abc(2)" to "abc(3)",
from "abc" to "abc(1)".
name: